import React from 'react'
import styles from './../styles/Favorite.module.css'
import FavoriteAmount from './LaiFavoriteAmount'
import FavoriteCard from './LaiFavoriteCard'

export default function LaiFavoriteContent() {
  return (
    <>
      <div className={styles['member-data']}>
        <div className={styles['title']}>
          <svg
            width="32"
            height="32"
            viewBox="0 0 24 25"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M20.8401 5.10999C20.3294 4.599 19.7229 4.19364 19.0555 3.91708C18.388 3.64052 17.6726 3.49817 16.9501 3.49817C16.2276 3.49817 15.5122 3.64052 14.8448 3.91708C14.1773 4.19364 13.5709 4.599 13.0601 5.10999L12.0001 6.16999L10.9401 5.10999C9.90843 4.0783 8.50915 3.4987 7.05012 3.4987C5.59109 3.4987 4.19181 4.0783 3.16012 5.10999C2.12843 6.14169 1.54883 7.54096 1.54883 8.99999C1.54883 10.459 2.12843 11.8583 3.16012 12.89L4.22012 13.95L12.0001 21.73L19.7801 13.95L20.8401 12.89C21.3511 12.3792 21.7565 11.7728 22.033 11.1053C22.3096 10.4379 22.4519 9.72248 22.4519 8.99999C22.4519 8.27751 22.3096 7.5621 22.033 6.89464C21.7565 6.22718 21.3511 5.62075 20.8401 5.10999Z"
              stroke="#6cba7c"
              strokeWidth="2"
              strokeLinecap="round"
              strokeLinejoin="round"
            />
          </svg>

          <h1>我的收藏</h1>
        </div>
        <div className={styles['container']}>
          <div className={styles['filter-area']}>
            <div className={styles['show-number']}>
              <p>已收藏</p>
              {/* TODO 連結真實的評論數 */}
              <FavoriteAmount amount={10} />
              {/* <p id={styles['fav-amount']}>5</p> */}
              <p>個行程</p>
            </div>
            <div className={styles['filter-btn']}>
              <select>
                <option>排列順序</option>
                <option>依照加入時間</option>
                <option>依照價格排序</option>
                <option>依照行程時間</option>
              </select>
            </div>
          </div>
          <div className={styles['fav-list']}>
            <FavoriteCard
              img={''}
              title={'草嶺古道｜探索新北一日遊'}
              describ={
                '你見過南橫之美嗎？自從2009年8月，南橫公路中斷之後，美麗的南橫三星便淪為黑山、少有人探訪，直到最近才又終於開放了許多山友鍾情的南橫三星！塔關山、關山嶺山、庫哈諾辛山皆為A級百岳，是適合當日來回的平易、絕美山嶺，封閉多年的原始森林風華更甚以往，台灣368還安排了專車接送往返民宿及各登山口，讓你飽覽南橫的沿線風光、更讓你輕鬆的入手三座百岳。'
              }
              location={'宜蘭縣頭城鎮'}
              // TODO星星數量的傳值
              starAmount={''}
              price={'2,400'}
            />
            <FavoriteCard
              img={''}
              title={'草嶺古道｜探索新北一日遊'}
              describ={
                '你見過南橫之美嗎？自從2009年8月，南橫公路中斷之後，美麗的南橫三星便淪為黑山、少有人探訪，直到最近才又終於開放了許多山友鍾情的南橫三星！塔關山、關山嶺山、庫哈諾辛山皆為A級百岳，是適合當日來回的平易、絕美山嶺，封閉多年的原始森林風華更甚以往，台灣368還安排了專車接送往返民宿及各登山口，讓你飽覽南橫的沿線風光、更讓你輕鬆的入手三座百岳。'
              }
              location={'宜蘭縣頭城鎮'}
              // TODO星星數量的傳值
              starAmount={''}
              price={'2,400'}
            />
            <FavoriteCard
              img={''}
              title={'草嶺古道｜探索新北一日遊'}
              describ={
                '你見過南橫之美嗎？自從2009年8月，南橫公路中斷之後，美麗的南橫三星便淪為黑山、少有人探訪，直到最近才又終於開放了許多山友鍾情的南橫三星！塔關山、關山嶺山、庫哈諾辛山皆為A級百岳，是適合當日來回的平易、絕美山嶺，封閉多年的原始森林風華更甚以往，台灣368還安排了專車接送往返民宿及各登山口，讓你飽覽南橫的沿線風光、更讓你輕鬆的入手三座百岳。'
              }
              location={'宜蘭縣頭城鎮'}
              // TODO星星數量的傳值
              starAmount={''}
              price={'3,400'}
            />
            <FavoriteCard
              img={''}
              title={'草嶺古道｜探索新北一日遊'}
              describ={
                '你見過南橫之美嗎？自從2009年8月，南橫公路中斷之後，美麗的南橫三星便淪為黑山、少有人探訪，直到最近才又終於開放了許多山友鍾情的南橫三星！塔關山、關山嶺山、庫哈諾辛山皆為A級百岳，是適合當日來回的平易、絕美山嶺，封閉多年的原始森林風華更甚以往，台灣368還安排了專車接送往返民宿及各登山口，讓你飽覽南橫的沿線風光、更讓你輕鬆的入手三座百岳。'
              }
              location={'宜蘭縣頭城鎮'}
              // TODO星星數量的傳值
              starAmount={''}
              price={'3,400'}
            />
            <FavoriteCard
              img={''}
              title={'草嶺古道｜探索新北一日遊'}
              describ={
                '你見過南橫之美嗎？自從2009年8月，南橫公路中斷之後，美麗的南橫三星便淪為黑山、少有人探訪，直到最近才又終於開放了許多山友鍾情的南橫三星！塔關山、關山嶺山、庫哈諾辛山皆為A級百岳，是適合當日來回的平易、絕美山嶺，封閉多年的原始森林風華更甚以往，台灣368還安排了專車接送往返民宿及各登山口，讓你飽覽南橫的沿線風光、更讓你輕鬆的入手三座百岳。'
              }
              location={'宜蘭縣頭城鎮'}
              // TODO星星數量的傳值
              starAmount={''}
              price={'3,400'}
            />
            {/* <div className={styles['fav-card']}>
              <div className={styles['fav-img-wrap']}>
                <div className={styles['fav-img']}></div>
              </div>
              <div className={styles['text-wrap']}>
                <div className={styles['fav-title']}>
                  <h6>草嶺古道｜探索新北一日遊</h6>
                  <div className={styles['trails-des']}>
                    <p>
                      你見過南橫之美嗎？自從2009年8月，南橫公路中斷之後，美麗的南橫三星便淪為黑山、少有人探訪，直到最近才又終於開放了許多山友鍾情的南橫三星！塔關山、關山嶺山、庫哈諾辛山皆為A級百岳，是適合當日來回的平易、絕美山嶺，封閉多年的原始森林風華更甚以往，台灣368還安排了專車接送往返民宿及各登山口，讓你飽覽南橫的沿線風光、更讓你輕鬆的入手三座百岳。
                    </p>
                  </div>
                </div>
                <div className={styles['location-stars']}>
                  <svg
                    width="20"
                    height="20"
                    viewBox="0 0 20 21"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M17.5 8.8335C17.5 14.6668 10 19.6668 10 19.6668C10 19.6668 2.5 14.6668 2.5 8.8335C2.5 6.84437 3.29018 4.93672 4.6967 3.53019C6.10322 2.12367 8.01088 1.3335 10 1.3335C11.9891 1.3335 13.8968 2.12367 15.3033 3.53019C16.7098 4.93672 17.5 6.84437 17.5 8.8335Z"
                      fill="#6CBA7C"
                    />
                    <path
                      d="M10 11.3335C11.3807 11.3335 12.5 10.2142 12.5 8.8335C12.5 7.45278 11.3807 6.3335 10 6.3335C8.61929 6.3335 7.5 7.45278 7.5 8.8335C7.5 10.2142 8.61929 11.3335 10 11.3335Z"
                      fill="white"
                    />
                  </svg>
                  <p>宜蘭縣頭城鎮</p>
                  <div className={styles['location-bar']}></div>
                  <svg
                    width="100"
                    height="21"
                    viewBox="0 0 100 21"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M9.99984 2.16675L12.5748 7.38341L18.3332 8.22508L14.1665 12.2834L15.1498 18.0167L9.99984 15.3084L4.84984 18.0167L5.83317 12.2834L1.6665 8.22508L7.42484 7.38341L9.99984 2.16675Z"
                      fill="#F3C969"
                    />
                    <path
                      d="M29.9998 2.16675L32.5748 7.38341L38.3332 8.22508L34.1665 12.2834L35.1498 18.0167L29.9998 15.3084L24.8498 18.0167L25.8332 12.2834L21.6665 8.22508L27.4248 7.38341L29.9998 2.16675Z"
                      fill="#F3C969"
                    />
                    <path
                      d="M49.9998 2.16675L52.5748 7.38341L58.3332 8.22508L54.1665 12.2834L55.1498 18.0167L49.9998 15.3084L44.8498 18.0167L45.8332 12.2834L41.6665 8.22508L47.4248 7.38341L49.9998 2.16675Z"
                      fill="#F3C969"
                    />
                    <path
                      d="M69.9998 2.16675L72.5748 7.38341L78.3332 8.22508L74.1665 12.2834L75.1498 18.0167L69.9998 15.3084L64.8498 18.0167L65.8332 12.2834L61.6665 8.22508L67.4248 7.38341L69.9998 2.16675Z"
                      fill="#F3C969"
                    />
                    <path
                      d="M89.9998 2.16675L92.5748 7.38341L98.3332 8.22508L94.1665 12.2834L95.1498 18.0167L89.9998 15.3084L84.8498 18.0167L85.8332 12.2834L81.6665 8.22508L87.4248 7.38341L89.9998 2.16675Z"
                      fill="#F3C969"
                    />
                  </svg>
                </div>
                <div className={styles['price-wrap']}>
                  <p>NTD</p>
                  <p id="price">1,200</p>
                </div>
              </div>
              <div className={styles['btn-wrap']}>
                <svg
                  className={styles['fav-btn']}
                  width="20"
                  height="18"
                  viewBox="0 0 24 25"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M20.8401 5.10999C20.3294 4.599 19.7229 4.19364 19.0555 3.91708C18.388 3.64052 17.6726 3.49817 16.9501 3.49817C16.2276 3.49817 15.5122 3.64052 14.8448 3.91708C14.1773 4.19364 13.5709 4.599 13.0601 5.10999L12.0001 6.16999L10.9401 5.10999C9.90843 4.0783 8.50915 3.4987 7.05012 3.4987C5.59109 3.4987 4.19181 4.0783 3.16012 5.10999C2.12843 6.14169 1.54883 7.54096 1.54883 8.99999C1.54883 10.459 2.12843 11.8583 3.16012 12.89L4.22012 13.95L12.0001 21.73L19.7801 13.95L20.8401 12.89C21.3511 12.3792 21.7565 11.7728 22.033 11.1053C22.3096 10.4379 22.4519 9.72248 22.4519 8.99999C22.4519 8.27751 22.3096 7.5621 22.033 6.89464C21.7565 6.22718 21.3511 5.62075 20.8401 5.10999Z"
                    stroke="#6cba7c"
                    strokeWidth="2"
                    strokeLinecap="round"
                    strokeLinejoin="round"
                  />
                </svg>
              </div>
            </div> */}
            {/* <div className={styles['fav-card']}>
              <div className={styles['fav-img-wrap']}>
                <div className={`${styles['fav-img']} ${styles['']}`}></div>
              </div>
              <div className={styles['text-wrap']}>
                <div className={styles['fav-title']}>
                  <h6>草嶺古道｜探索新北一日遊</h6>
                  <div className={styles['trails-des']}>
                    <p>
                      你見過南橫之美嗎？自從2009年8月，南橫公路中斷之後，美麗的南橫三星便淪為黑山、少有人探訪，直到最近才又終於開放了許多山友鍾情的南橫三星！塔關山、關山嶺山、庫哈諾辛山皆為A級百岳，是適合當日來回的平易、絕美山嶺，封閉多年的原始森林風華更甚以往，台灣368還安排了專車接送往返民宿及各登山口，讓你飽覽南橫的沿線風光、更讓你輕鬆的入手三座百岳。
                    </p>
                  </div>
                </div>
                <div className={styles['location-stars']}>
                  <svg
                    width="20"
                    height="20"
                    viewBox="0 0 20 21"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M17.5 8.8335C17.5 14.6668 10 19.6668 10 19.6668C10 19.6668 2.5 14.6668 2.5 8.8335C2.5 6.84437 3.29018 4.93672 4.6967 3.53019C6.10322 2.12367 8.01088 1.3335 10 1.3335C11.9891 1.3335 13.8968 2.12367 15.3033 3.53019C16.7098 4.93672 17.5 6.84437 17.5 8.8335Z"
                      fill="#6CBA7C"
                    />
                    <path
                      d="M10 11.3335C11.3807 11.3335 12.5 10.2142 12.5 8.8335C12.5 7.45278 11.3807 6.3335 10 6.3335C8.61929 6.3335 7.5 7.45278 7.5 8.8335C7.5 10.2142 8.61929 11.3335 10 11.3335Z"
                      fill="white"
                    />
                  </svg>
                  <p>嘉義縣梅山鎮</p>
                  <div className={styles['location-bar']}></div>
                  <svg
                    width="100"
                    height="21"
                    viewBox="0 0 100 21"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M9.99984 2.16675L12.5748 7.38341L18.3332 8.22508L14.1665 12.2834L15.1498 18.0167L9.99984 15.3084L4.84984 18.0167L5.83317 12.2834L1.6665 8.22508L7.42484 7.38341L9.99984 2.16675Z"
                      fill="#F3C969"
                    />
                    <path
                      d="M29.9998 2.16675L32.5748 7.38341L38.3332 8.22508L34.1665 12.2834L35.1498 18.0167L29.9998 15.3084L24.8498 18.0167L25.8332 12.2834L21.6665 8.22508L27.4248 7.38341L29.9998 2.16675Z"
                      fill="#F3C969"
                    />
                    <path
                      d="M49.9998 2.16675L52.5748 7.38341L58.3332 8.22508L54.1665 12.2834L55.1498 18.0167L49.9998 15.3084L44.8498 18.0167L45.8332 12.2834L41.6665 8.22508L47.4248 7.38341L49.9998 2.16675Z"
                      fill="#F3C969"
                    />
                    <path
                      d="M69.9998 2.16675L72.5748 7.38341L78.3332 8.22508L74.1665 12.2834L75.1498 18.0167L69.9998 15.3084L64.8498 18.0167L65.8332 12.2834L61.6665 8.22508L67.4248 7.38341L69.9998 2.16675Z"
                      fill="#F3C969"
                    />
                  </svg>
                </div>
                <div className={styles['price-wrap']}>
                  <p>NTD</p>
                  <p id="price">4,800</p>
                </div>
              </div>
              <div className={styles['btn-wrap']}>
                <svg
                  className={styles['fav-btn']}
                  width="20"
                  height="18"
                  viewBox="0 0 24 25"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M20.8401 5.10999C20.3294 4.599 19.7229 4.19364 19.0555 3.91708C18.388 3.64052 17.6726 3.49817 16.9501 3.49817C16.2276 3.49817 15.5122 3.64052 14.8448 3.91708C14.1773 4.19364 13.5709 4.599 13.0601 5.10999L12.0001 6.16999L10.9401 5.10999C9.90843 4.0783 8.50915 3.4987 7.05012 3.4987C5.59109 3.4987 4.19181 4.0783 3.16012 5.10999C2.12843 6.14169 1.54883 7.54096 1.54883 8.99999C1.54883 10.459 2.12843 11.8583 3.16012 12.89L4.22012 13.95L12.0001 21.73L19.7801 13.95L20.8401 12.89C21.3511 12.3792 21.7565 11.7728 22.033 11.1053C22.3096 10.4379 22.4519 9.72248 22.4519 8.99999C22.4519 8.27751 22.3096 7.5621 22.033 6.89464C21.7565 6.22718 21.3511 5.62075 20.8401 5.10999Z"
                    stroke="#6cba7c"
                    strokeWidth="2"
                    strokeLinecap="round"
                    strokeLinejoin="round"
                  />
                </svg>
              </div>
            </div> */}
            {/* <div className={styles['']}"fav-card">
                <div class="fav-img-wrap">
                  <img class="fav-img" src="../../public/trails3.png">
                </div>
                <div class="text-wrap">
                  <div class="fav-title">
                    <h6>草嶺古道｜探索新北一日遊探索新北一日遊</h6>
                    <div class="trails-des">
                      <p>你見過南橫之美嗎？自從2009年8月，南橫公路中斷之後，美麗的南橫三星便淪為黑山、少有人探訪，直到最近才又終於開放了許多山友鍾情的南橫三星！塔關山、關山嶺山、庫哈諾辛山皆為A級百岳，是適合當日來回的平易、絕美山嶺，封閉多年的原始森林風華更甚以往，台灣368還安排了專車接送往返民宿及各登山口，讓你飽覽南橫的沿線風光、更讓你輕鬆的入手三座百岳。</p>
                    </div>
                  </div>
                  <div class="location-stars">
                    <svg width="20" height="20" viewBox="0 0 20 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M17.5 8.8335C17.5 14.6668 10 19.6668 10 19.6668C10 19.6668 2.5 14.6668 2.5 8.8335C2.5 6.84437 3.29018 4.93672 4.6967 3.53019C6.10322 2.12367 8.01088 1.3335 10 1.3335C11.9891 1.3335 13.8968 2.12367 15.3033 3.53019C16.7098 4.93672 17.5 6.84437 17.5 8.8335Z" fill="#6CBA7C"/>
                      <path d="M10 11.3335C11.3807 11.3335 12.5 10.2142 12.5 8.8335C12.5 7.45278 11.3807 6.3335 10 6.3335C8.61929 6.3335 7.5 7.45278 7.5 8.8335C7.5 10.2142 8.61929 11.3335 10 11.3335Z" fill="white"/>
                    </svg>
                    <p>嘉義縣梅山鎮</p>
                    <div class="location-bar"></div>
                    <svg width="100" height="21" viewBox="0 0 100 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M9.99984 2.16675L12.5748 7.38341L18.3332 8.22508L14.1665 12.2834L15.1498 18.0167L9.99984 15.3084L4.84984 18.0167L5.83317 12.2834L1.6665 8.22508L7.42484 7.38341L9.99984 2.16675Z" fill="#F3C969"/>
                      <path d="M29.9998 2.16675L32.5748 7.38341L38.3332 8.22508L34.1665 12.2834L35.1498 18.0167L29.9998 15.3084L24.8498 18.0167L25.8332 12.2834L21.6665 8.22508L27.4248 7.38341L29.9998 2.16675Z" fill="#F3C969"/>
                      <path d="M49.9998 2.16675L52.5748 7.38341L58.3332 8.22508L54.1665 12.2834L55.1498 18.0167L49.9998 15.3084L44.8498 18.0167L45.8332 12.2834L41.6665 8.22508L47.4248 7.38341L49.9998 2.16675Z" fill="#F3C969"/>
                      <path d="M69.9998 2.16675L72.5748 7.38341L78.3332 8.22508L74.1665 12.2834L75.1498 18.0167L69.9998 15.3084L64.8498 18.0167L65.8332 12.2834L61.6665 8.22508L67.4248 7.38341L69.9998 2.16675Z" fill="#F3C969"/>
                      </svg>
                  </div>
                  <div class="price-wrap">
                    <p>NTD</p>
                    <p id="price">4,800</p>
                  </div>
                </div>
                <div class="btn-wrap">
                  <svg class="fav-btn" width="20" height="18" viewBox="0 0 24 25" xmlns="http://www.w3.org/2000/svg">
                      <path d="M20.8401 5.10999C20.3294 4.599 19.7229 4.19364 19.0555 3.91708C18.388 3.64052 17.6726 3.49817 16.9501 3.49817C16.2276 3.49817 15.5122 3.64052 14.8448 3.91708C14.1773 4.19364 13.5709 4.599 13.0601 5.10999L12.0001 6.16999L10.9401 5.10999C9.90843 4.0783 8.50915 3.4987 7.05012 3.4987C5.59109 3.4987 4.19181 4.0783 3.16012 5.10999C2.12843 6.14169 1.54883 7.54096 1.54883 8.99999C1.54883 10.459 2.12843 11.8583 3.16012 12.89L4.22012 13.95L12.0001 21.73L19.7801 13.95L20.8401 12.89C21.3511 12.3792 21.7565 11.7728 22.033 11.1053C22.3096 10.4379 22.4519 9.72248 22.4519 8.99999C22.4519 8.27751 22.3096 7.5621 22.033 6.89464C21.7565 6.22718 21.3511 5.62075 20.8401 5.10999Z" stroke="#6cba7c" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
                      </svg>
                </div>
              </div>
              <div class="fav-card">
                <div class="fav-img-wrap">
                  <img class="fav-img" src="../../public/trails4.png">
                </div>
                <div class="text-wrap">
                  <div class="fav-title">
                    <h6>草嶺古道｜探索新北一日遊探索新北一日遊</h6>
                    <div class="trails-des">
                      <p>你見過南橫之美嗎？自從2009年8月，南橫公路中斷之後，美麗的南橫三星便淪為黑山、少有人探訪，直到最近才又終於開放了許多山友鍾情的南橫三星！塔關山、關山嶺山、庫哈諾辛山皆為A級百岳，是適合當日來回的平易、絕美山嶺，封閉多年的原始森林風華更甚以往，台灣368還安排了專車接送往返民宿及各登山口，讓你飽覽南橫的沿線風光、更讓你輕鬆的入手三座百岳。</p>
                    </div>
                  </div>
                  <div class="location-stars">
                    <svg width="20" height="20" viewBox="0 0 20 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M17.5 8.8335C17.5 14.6668 10 19.6668 10 19.6668C10 19.6668 2.5 14.6668 2.5 8.8335C2.5 6.84437 3.29018 4.93672 4.6967 3.53019C6.10322 2.12367 8.01088 1.3335 10 1.3335C11.9891 1.3335 13.8968 2.12367 15.3033 3.53019C16.7098 4.93672 17.5 6.84437 17.5 8.8335Z" fill="#6CBA7C"/>
                      <path d="M10 11.3335C11.3807 11.3335 12.5 10.2142 12.5 8.8335C12.5 7.45278 11.3807 6.3335 10 6.3335C8.61929 6.3335 7.5 7.45278 7.5 8.8335C7.5 10.2142 8.61929 11.3335 10 11.3335Z" fill="white"/>
                    </svg>
                    <p>嘉義縣梅山鎮</p>
                    <div class="location-bar"></div>
                    <svg width="100" height="21" viewBox="0 0 100 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M9.99984 2.16675L12.5748 7.38341L18.3332 8.22508L14.1665 12.2834L15.1498 18.0167L9.99984 15.3084L4.84984 18.0167L5.83317 12.2834L1.6665 8.22508L7.42484 7.38341L9.99984 2.16675Z" fill="#F3C969"/>
                      <path d="M29.9998 2.16675L32.5748 7.38341L38.3332 8.22508L34.1665 12.2834L35.1498 18.0167L29.9998 15.3084L24.8498 18.0167L25.8332 12.2834L21.6665 8.22508L27.4248 7.38341L29.9998 2.16675Z" fill="#F3C969"/>
                      <path d="M49.9998 2.16675L52.5748 7.38341L58.3332 8.22508L54.1665 12.2834L55.1498 18.0167L49.9998 15.3084L44.8498 18.0167L45.8332 12.2834L41.6665 8.22508L47.4248 7.38341L49.9998 2.16675Z" fill="#F3C969"/>
                      <path d="M69.9998 2.16675L72.5748 7.38341L78.3332 8.22508L74.1665 12.2834L75.1498 18.0167L69.9998 15.3084L64.8498 18.0167L65.8332 12.2834L61.6665 8.22508L67.4248 7.38341L69.9998 2.16675Z" fill="#F3C969"/>
                      </svg>
                  </div>
                  <div class="price-wrap">
                    <p>NTD</p>
                    <p id="price">4,800</p>
                  </div>
                </div>
                <div class="btn-wrap">
                  <svg class="fav-btn" width="20" height="18" viewBox="0 0 24 25" xmlns="http://www.w3.org/2000/svg">
                      <path d="M20.8401 5.10999C20.3294 4.599 19.7229 4.19364 19.0555 3.91708C18.388 3.64052 17.6726 3.49817 16.9501 3.49817C16.2276 3.49817 15.5122 3.64052 14.8448 3.91708C14.1773 4.19364 13.5709 4.599 13.0601 5.10999L12.0001 6.16999L10.9401 5.10999C9.90843 4.0783 8.50915 3.4987 7.05012 3.4987C5.59109 3.4987 4.19181 4.0783 3.16012 5.10999C2.12843 6.14169 1.54883 7.54096 1.54883 8.99999C1.54883 10.459 2.12843 11.8583 3.16012 12.89L4.22012 13.95L12.0001 21.73L19.7801 13.95L20.8401 12.89C21.3511 12.3792 21.7565 11.7728 22.033 11.1053C22.3096 10.4379 22.4519 9.72248 22.4519 8.99999C22.4519 8.27751 22.3096 7.5621 22.033 6.89464C21.7565 6.22718 21.3511 5.62075 20.8401 5.10999Z" stroke="#6cba7c" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
                      </svg>
                </div>
              </div>
              <div class="fav-card">
                <div class="fav-img-wrap">
                  <img class="fav-img" src="../../public/trails3.png">
                </div>
                <div class="text-wrap">
                  <div class="fav-title">
                    <h6>草嶺古道｜探索新北一日遊探索新北一日遊</h6>
                    <div class="trails-des">
                      <p>你見過南橫之美嗎？自從2009年8月，南橫公路中斷之後，美麗的南橫三星便淪為黑山、少有人探訪，直到最近才又終於開放了許多山友鍾情的南橫三星！塔關山、關山嶺山、庫哈諾辛山皆為A級百岳，是適合當日來回的平易、絕美山嶺，封閉多年的原始森林風華更甚以往，台灣368還安排了專車接送往返民宿及各登山口，讓你飽覽南橫的沿線風光、更讓你輕鬆的入手三座百岳。</p>
                    </div>
                  </div>
                  <div class="location-stars">
                    <svg width="20" height="20" viewBox="0 0 20 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M17.5 8.8335C17.5 14.6668 10 19.6668 10 19.6668C10 19.6668 2.5 14.6668 2.5 8.8335C2.5 6.84437 3.29018 4.93672 4.6967 3.53019C6.10322 2.12367 8.01088 1.3335 10 1.3335C11.9891 1.3335 13.8968 2.12367 15.3033 3.53019C16.7098 4.93672 17.5 6.84437 17.5 8.8335Z" fill="#6CBA7C"/>
                      <path d="M10 11.3335C11.3807 11.3335 12.5 10.2142 12.5 8.8335C12.5 7.45278 11.3807 6.3335 10 6.3335C8.61929 6.3335 7.5 7.45278 7.5 8.8335C7.5 10.2142 8.61929 11.3335 10 11.3335Z" fill="white"/>
                    </svg>
                    <p>嘉義縣梅山鎮</p>
                    <div class="location-bar"></div>
                    <svg width="100" height="21" viewBox="0 0 100 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M9.99984 2.16675L12.5748 7.38341L18.3332 8.22508L14.1665 12.2834L15.1498 18.0167L9.99984 15.3084L4.84984 18.0167L5.83317 12.2834L1.6665 8.22508L7.42484 7.38341L9.99984 2.16675Z" fill="#F3C969"/>
                      <path d="M29.9998 2.16675L32.5748 7.38341L38.3332 8.22508L34.1665 12.2834L35.1498 18.0167L29.9998 15.3084L24.8498 18.0167L25.8332 12.2834L21.6665 8.22508L27.4248 7.38341L29.9998 2.16675Z" fill="#F3C969"/>
                      <path d="M49.9998 2.16675L52.5748 7.38341L58.3332 8.22508L54.1665 12.2834L55.1498 18.0167L49.9998 15.3084L44.8498 18.0167L45.8332 12.2834L41.6665 8.22508L47.4248 7.38341L49.9998 2.16675Z" fill="#F3C969"/>
                      <path d="M69.9998 2.16675L72.5748 7.38341L78.3332 8.22508L74.1665 12.2834L75.1498 18.0167L69.9998 15.3084L64.8498 18.0167L65.8332 12.2834L61.6665 8.22508L67.4248 7.38341L69.9998 2.16675Z" fill="#F3C969"/>
                      </svg>
                  </div>
                  <div class="price-wrap">
                    <p>NTD</p>
                    <p id="price">4,800</p>
                  </div>
                </div>
                <div class="btn-wrap">
                  <svg class="fav-btn" width="20" height="18" viewBox="0 0 24 25" xmlns="http://www.w3.org/2000/svg">
                      <path d="M20.8401 5.10999C20.3294 4.599 19.7229 4.19364 19.0555 3.91708C18.388 3.64052 17.6726 3.49817 16.9501 3.49817C16.2276 3.49817 15.5122 3.64052 14.8448 3.91708C14.1773 4.19364 13.5709 4.599 13.0601 5.10999L12.0001 6.16999L10.9401 5.10999C9.90843 4.0783 8.50915 3.4987 7.05012 3.4987C5.59109 3.4987 4.19181 4.0783 3.16012 5.10999C2.12843 6.14169 1.54883 7.54096 1.54883 8.99999C1.54883 10.459 2.12843 11.8583 3.16012 12.89L4.22012 13.95L12.0001 21.73L19.7801 13.95L20.8401 12.89C21.3511 12.3792 21.7565 11.7728 22.033 11.1053C22.3096 10.4379 22.4519 9.72248 22.4519 8.99999C22.4519 8.27751 22.3096 7.5621 22.033 6.89464C21.7565 6.22718 21.3511 5.62075 20.8401 5.10999Z" stroke="#6cba7c" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
                      </svg>
                </div>
              </div> */}
          </div>
        </div>
      </div>
    </>
  )
}
